import sqlite3
import numpy as np

# 建立连接
conn = sqlite3.connect('../data/mars_tianchi.db')
"""
1,3544044
2,227351
3,56254
4,24432
5,13917
6,9130
7,6258
8,4840
9,3534
10,2893
-----------
11,2361
12,2088
13,2057
14,1821
15,1411
16,1196
17,795
18,593
19,451
20,339
21,269
22,166
23,161
24,142
25,111
26,103
27,71
28,84
29,82
30,64
31,45
32,40
33,25
34,31
35,28
36,53
37,22
38,37
39,25
40,15
41,15
42,10
43,8
44,21
45,12
46,17
47,15
48,13
49,9
50,6
51,8
52,2
53,6
54,7
55,7
56,7
57,7
58,12
59,9
60,4
61,5
62,2
63,2
64,3
65,4
66,6
67,4
68,7
69,6
70,4
71,1
72,3
73,2
74,1
75,3
76,1
77,1
78,3
79,1
80,3
81,2
83,1
84,8
85,3
86,4
87,2
88,2
89,1
90,2
91,2
94,5
95,1
96,1
98,2
99,3
100,2
104,1
106,3
107,2
108,2
109,3
110,1
114,1
116,1
118,1
123,2
129,2
130,1
132,1
134,1
136,1
138,1
140,1
142,1
147,1
151,1
152,1
153,1
157,1
160,1
163,1
172,1
187,1
189,1
198,1
221,1
224,1
227,1
285,1
323,1
414,1
671,1
1187,1
"""
# 每个听众每小时听每首歌10遍以上的按10遍来算 歌曲3~5分钟
def modify(artist_id):
    print('deal %s' % artist_id)
    update_str = "update statistics_%s set playCount = 10 WHERE playCount>10" % artist_id
    conn.execute(update_str)


select_str = "SELECT DISTINCT(artist_id) FROM songs"
artists = np.array(conn.execute(select_str).fetchall())[:, 0]

for artist_id in artists:
    modify(artist_id)
conn.commit()
print('done')
